Revit 2024 API
ParameterTypeId.DpartLayerConstruction Property
 "Construction"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId DpartLayerConstruction { get; }
Visual Basic
Public Shared ReadOnly Property DpartLayerConstruction As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DpartLayerConstruction {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace